<%@ page contentType="text/html; charset=UTF-8"%>
<%@ taglib prefix="c" uri="http://java.sun.com/jsp/jstl/core"%>
<%
	request.setCharacterEncoding("UTF-8");
	String cp = request.getContextPath();
%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Terms_Leader.jsp</title>
</head>
<body>
<div id="Terms">
	<br /><br />
	<h3>스터디 리더 가이드</h3>
	
	<span style="white-space: pre-line;">
	2-1. 스터디 개설
	- 스터디 개설이 가능한 사용자의 등급은 4등급(기본등급)이다.
	- 로그인을 하지 않은 사용자가 개설 신청을 누르면 로그인을 하라는 알림(확인/취소)이 뜨고, 확인을 누르면 로그인 페이지로 이동하며, 취소 버튼을 누르면 원래 있던 페이지로 돌아간다.
	
	- 스터디 4등급인 사람이 개설 신청을 누르면 개설 등급이 아니라는 알림이 뜬다.
	
	- 참여 중인 스터디가 3개인 회원은 ‘참여할 수 있는 스터디의 수(최대 3개)를 초과하였습니다.’ 알림이 뜬다.
	- 스터디를 등록할 때는 필수 입력사항으로 스터디 이름, 장소(온/오프라인여부), 시작날짜, 종료날짜, 시작시간, 종료시간, 스터디 진행 요일, 최소인원수, 최대인원수, 구체적인 내용(목적 및 목표), 구직여부(상관없음 포함), 스터디 참여 가능 등급을 입력한다.
	- 스터디 개설 시간대는 개설자 자율에 맡긴다.
	- 스터디 개설 인원수는 3명 ~ 8명으로 최소인원수는 3~8명 중 선택할 수 있고, 최대인원수는 3~8명으로 선택할 수 있는데, 최대인원수가 최소인원수보다 적으면 [최대인원수는 최소인원수보다 적게 선택할 수 없습니다]라는 알림을 띄운다.
	- 스터디 종료 날짜는 시작 날짜를 선택한 후에 활성화 되며, 시작 날짜로부터 1년 이내의 날짜만 선택할 수 있도록 뜬다.
	- 시작 날짜는 현재로부터 10일 이후 15일 이내의 날짜만 선택할 수 있도록 하며, 날짜 선택지 하단에   [시작 날짜는 10일 이후부터 15일 이내의 날짜만 선택 가능합니다.]  알림 문구를 띄워 준다.
	- 스터디 개설자는 이미 개설한 스터디 및 참여중인 스터디 기간과 요일/시간이 겹치는 스터디는 만들지 못한다.
	- 스터디 종료 시간은 선택은 스터디 시작 시간을 선택해야 활성화 되며, 스터디 시작 시간으로부터 1시간 이상, 12시간 이하의 시간만 선택할 수 있도록 뜬다.
	- 스터디를 등록할 때 참여할 수 있는 회원등급을 직접 설정할 수 있다. 최소등급은 본인의 등급 이하로 설정할 수 있고, 최고등급은 설정 제한이 없다.
	- 구성원은 현직, 취준생 등 자유롭게 설정하여 참여할 수 있다.
	- 스터디의 가개설기간은 수정가능기간(5~7일)과 확정기간(5일)으로 구성된다.
	
	- 모든 정보 입력 후 스터디 개설 버튼을 누르면 입력한 사항을 모두 보여 준 후 ‘입력하신 사항을 모두 확인하셨습니까?’라는 알림을 띄우고, 확인 버튼을 누르면 스터디 모집 글 등록, 취소를 누르면 필수사항을 입력하는 페이지로 돌아간다.
	
	- 스터디 이름에 욕설이 들어가 있으면 [스터디이름에는 욕설을 사용할 수 없습니다.]라는 알림을 띄운다.
	
	- 스터디 이름은 30자 이내로 설정할 수 있다.
	
	내
	용
	추
	가
	:
	
	
	</span>
	
</div><!-- #Terms -->
</body>
</html>