<%@ page contentType="text/html; charset=UTF-8"%>
<%@ taglib prefix="c" uri="http://java.sun.com/jsp/jstl/core"%>
<%
	request.setCharacterEncoding("UTF-8");
	String cp = request.getContextPath();
%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Terms_Entry.jsp</title>
</head>
<body>

<div id="Terms">
	<br /><br />
	<h3>스터디 참가자 가이드</h3>
	
	<span style="white-space: pre-line;">
  	2-7. 평가
	- 스터디가 종료되면 사용자는 본인을 제외한 나머지 스터디원에 대한 상호 평가와 스터디 만족도를 평가해야 한다.
	- 사용자는 스터디 평가를 마치면 상호 평가 결과에 따라 점수를 받는다.
	- 평가는 스터디 종료 후 2주 안에 완료해야 하며, 스터디 평가를 마쳐야 새로운 스터디를 신청할 수 있다.
	- 2주의 기간이 지나도 평가를 하지 않으면 스터디 완료에 따른 보상 점수를 얻지 못한다.
	- 스터디 상호평가 결과 점수가 음수일 경우, 평가기간동안 평가를 완료하지 않아도 점수에 적용된다.
	- 스터디가 종료되면 로그인 시 2주 동안 스터디원 상호평가, 스터디 만족도에 대한 페이지가 뜬다. 평가는 스터디 종료 후 2주 안에 완료해야 하며 스터디원에 대한 평가 및 스터디 만족도는 스터디 종료 후 한 번만 작성하며 반드시 작성해야 한다. 기간 내에 완료하지 못한 경우, 평가에 따른 점수도 받지 못하고 새로운 스터디에 참여하지 못하게 된다.
	- 평가할 스터디원의 아이디를 클릭하면 필수 평가의 각 항목(과제, 의사소통능력, 참여도)과 이에 대한 답변 및 점수는 다음과 같이 5개로 구성되어 있다.                                                                                                                                                           
	 『     매우 잘함    /     잘함   /     보통    /     부족함    /     매우 부족함                                                                                                                                 
	            100                80             60               40                   20             』
	   
	- 해당 스터디원에 대한 평가를 진행하면 마지막 항목으로 건의사항/ 하고 싶은 말을 자유롭게 쓸 수 있다.                    이것은 필수사항은 아니다. (공백도 인정)
	- 스터디 만족도 평가는 별다른 문항 없이 별점(5점 만점)으로 5개 항목 중 선택할 수 있다. 


	내
	용
	추
	가
	:
	
	
	</span>
</div><!-- #Terms -->
</body>
</html>